Revit 2027 API
VertexPosition Methods
The VertexPosition type exposes the following members.
Methods
Name | Description
Dispose
(Inherited from Vertex)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetSizeInFloats |  Gets the amount of storage that the vertex takes up in a buffer, measured in floats.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
VertexPosition Class
Autodesk.Revit.DB.DirectContext3D Namespace